{
  "MENU": {
    "HOME": "Home",
    "PROJECTS": "Projects",
    "BLOG": "Blog",
    "SKILLS": "Skills",
    "NETWORKS": "Networks"
  },
  "HOME": {
    "TITLE": "Mario Jiménez Marset",
    "SUBTITLE": "Full Stack Web Developer",
    "DESCRIPTION": "Web and Multiplatform Application Development Technician, with specialized training in Full Stack technologies and Multicloud deployment. Passionate about creating efficient, usable and well-structured solutions.",
    "STATUS": {
      "AVAILABLE": "Available",
      "BUSY": "Busy"
    },
    "DOWNLOAD_CV": "Download CV",
    "CODING_YEARS": "Years coding",
    "PROJECTS": "Projects",
    "TIMEZONE": "Madrid, Spain",
    "LOCATION": "Madrid, Spain"
  },
  "THEME": {
    "DARK": "Switch to light mode",
    "LIGHT": "Switch to dark mode"
  },
  "LANGUAGE": {
    "SELECT": "Select language",
    "SPANISH": "Spanish",
    "ENGLISH": "English"
  },
  "SOCIAL": {
    "LINKEDIN": "LinkedIn",
    "GITHUB": "GitHub",
    "EMAIL": "Email"
  },
  "SKILLS": {
    "TITLE": "My Skills",
    "PROJECTS": "Projects:",
    "CLICK_MORE": "Click to see more",
    "OVERVIEW": "Overview",
    "STRENGTHS": "Strengths",
    "DETAILED_PROJECTS": "Detailed Projects",
    "ROLE": "Role",
    "DURATION": "Duration",
    "CERTIFICATIONS": "Certifications",
    "VIEW_CERTIFICATE": "View Certificate",
    "CATEGORIES": {
      "FRONTEND": "Frontend",
      "BACKEND": "Backend",
      "CLOUD": "Cloud",
      "BASES_DE_DATOS": "Databases",
      "HERRAMIENTAS": "Tools"
    },
    "TECH_DESCRIPTIONS": {
      "ANGULAR": "Angular is more than a tool, it's a platform. — Misko Hevery",
      "REACT": "Think of React as a set of reusable components. — Dan Abramov",
      "VUE": "Vue.js is progressive by design. — Evan You",
      "JQUERY": "jQuery: Write less, do more. — John Resig",
      "JAVASCRIPT": "JavaScript is the only language people think they don't need to learn before using. — Douglas Crockford",
      "IONIC": "Build mobile apps with web technologies. — Max Lynch (CEO of Ionic)",
      "CSHARP": "C# combines the power of C++ with the simplicity of Visual Basic. — Anders Hejlsberg",
      "JAVA": "Write once, run anywhere. — Sun Microsystems",
      "PYTHON": "Python is a programming language that lets you work quickly. — Python.org",
      "DOTNET": ".NET is a free, open-source developer platform. — Microsoft",
      "SQL": "Without data, you're just another person with an opinion. — W. Edwards Deming",
      "MYSQL": "MySQL is the world's most popular open source database. — MySQL Team",
      "ORACLE": "Oracle Database: The world's most complete data platform. — Oracle Corporation",
      "DJANGO": "Django makes it easier to build better web apps more quickly. — Django Team",
      "AZURE": "The cloud is the future of computing. — Satya Nadella",
      "POWER_PLATFORM": "The power to create solutions is in everyone's hands. — Charles Lamanna (Microsoft)",
      "AWS": "You don't have to reinvent the wheel to scale in the cloud. — Werner Vogels (CTO of Amazon)",
      "GIT": "Version control is not just a tool, it's a development philosophy. — Linus Torvalds"
    }
  },
  "EXPERIENCE": {
    "TITLE": "Experience",
    "STUDIES": "Studies",
    "TECHNOLOGIES": "Technologies",
    "INTERNSHIP": "Internship",
    "FINAL_GRADE": "Final Grade",
    "POSITIONS": {
      "INTERNSHIP": "Internship",
      "JUNIOR_ANALYST": "Junior Analyst",
      "DEVELOPER": "Developer",
      "SPECIALIST": "Specialist"
    },
    "COMPANIES": {
      "AVANADE": "Avanade",
      "SMARTBITS": "SmartBits IT Business Solutions",
      "VOLTEO": "Volteo Digital"
    },
    "DESCRIPTIONS": {
      "AVANADE": "Internship from September to December 2025 as Full-Stack Development Intern. Performing testing tasks, database queries for daily request and incident management, and managing applications through .NET 3.5. Gaining experience in professional environments with agile methodologies and collaborative development tools.",
      "AVANADE_JUNIOR": "From December 2025 as Junior Analyst in development and support teams. Continuing with application analysis and testing, Oracle database queries, and system administration with .NET 3.5. Actively participating in projects with Agile methodology, using collaborative tools and deepening process optimization knowledge.",
      "SMARTBITS": "Development and management of WordPress websites, working on theme customization and functionality using HTML, CSS, PHP, JavaScript, jQuery and AJAX. I contributed to user experience optimization and web page performance improvement, applying frontend development best practices.",
      "VOLTEO": "Training and practice on the ServiceNow cloud service management platform, acquiring knowledge in workflow configuration, process automation and incident management."
    },
    "ACADEMIC": {
      "MASTER": "MASTER'S DEGREE IN FULL STACK WEB DEVELOPMENT + MULTICLOUD",
      "MASTER_DESC": "Intensive 814-hour in-person Master's degree in Full Stack Web Development, with learning in C#, .NET Core, SQL Server, Angular, React, Vue and cloud solutions with Azure and AWS, completing practical projects and obtaining official certifications in Power Platform, Azure and AWS.",
      "DAW": "Higher Degree in Web Application Development",
      "DAW_DESC": "Higher Level Training Cycle in Web Application Development, with learning in interface design, application deployment, mobile device development, client and server environment programming, and database management.",
      "DAM": "Higher Degree in Multiplatform Application Development",
      "DAM_DESC": "Higher Level Training Cycle in Multiplatform Application Development, with learning in programming, data access, interface development, mobile devices, services and processes, as well as databases, computer systems, markup languages, development environments and business management systems."
    },
    "INSTITUTIONS": {
      "TAJAMAR": "Tajamar",
      "SALESIANAS": "Salesianas Plaza Castilla",
      "SANTA_ANA": "Santa Ana y San Rafael"
    },
    "DATES": {
      "SEP_2025_DEC_2025": "September 2025 - December 2025",
      "DEC_2025_PRESENT": "December 2025 - Present",
      "MAR_2024_JUN_2024": "March 2024 - June 2024",
      "MAR_2023_JUN_2023": "March 2023 - June 2023",
      "OCT_2024_JUN_2025": "October 2024 - June 2025",
      "SEP_2023_JUN_2024": "September 2023 - June 2024",
      "SEP_2021_JUN_2023": "September 2021 - June 2023"
    }
  },
  "PROJECTS": {
    "TITLE": "MY PROJECTS",
    "CLICK_TO_EXPAND": "Click to expand",
    "CLOSE": "Close",
    "SHOW_DETAILS": "Show details",
    "HIDE_DETAILS": "Hide details",
    "DESCRIPTION": "Description",
    "TECHNOLOGIES": "Technologies",
    "CHRONOLOGY": "Chronology",
    "START": "Start",
    "END": "End",
    "DURATION": "Duration",
    "EVALUATION": "Evaluation",
    "RATING": "Rating",
    "STATUS": "Status",
    "GALLERY": "Image Gallery",
    "DETAILED_VIEW": "Detailed view",
    "VIEW_PROJECT": "View Project",
    "VIEW_CODE": "View Code",
    "PROJECT_WITHOUT_DEPLOYMENT": "Project without available deployment",
    "VIEW_LIVE_PROJECT": "View live project",
    "CODE_NOT_AVAILABLE": "Code not available",
    "VIEW_SOURCE_CODE": "View source code",
    "NOTE": "Note",
    "COMPLETED": "Completed",
    "IN_DEVELOPMENT": "In development",
    "PAUSED": "Paused",
    "MONTHS": "months",
    "YEARS": "years",
    "IMAGE_OF": "Image of",
    "TITLES": {
      "ZUVO_PET": "Zuvo Pet - Pet Adoption Platform",
      "CHARLAS_TAJAMAR": "Tajamar Talks Management",
      "SERVICIOS_INFORMATICOS_2": "IT Services 2.0",
      "SERVICIOS_INFORMATICOS_1": "IT Services 1.0",
      "CAUSALITY360": "Causality360 - Intelligent News Analysis"
    },
    "DESCRIPTIONS": {
      "ZUVO_PET": "ZuvoPet is a platform developed as Final Project for the FULL STACK WEB DEVELOPMENT + MULTICLOUD MASTER'S DEGREE at Tajamar Tech. Its purpose is to connect animal shelters with people interested in adoption, facilitating the process through an intuitive experience and functionalities adapted to each type of user (shelters and adopters).\n\nThe application was developed individually with .NET Core MVC and C#, following the MVC design pattern and employing a service-based architecture. It includes a custom API, a personalized NuGet package for models and DTOs, and was complemented with frontend technologies like HTML, CSS, Bootstrap, JavaScript and Razor. The original deployment was performed on Microsoft Azure, including the migration from local database to the cloud.\n\nSubsequently, a complete migration to Amazon Web Services (AWS) was carried out in collaboration with two master's classmates, adapting the architecture to the AWS cloud environment. This process included:\n\n• API redesign as serverless application using AWS Lambda and API Gateway.\n• Replacement of SQL Server with MySQL and adjustments in the data layer.\n• Deployment on an EC2 instance with Portainer, use of Amazon S3 for static files and domain configuration with DuckDNS and Nginx as reverse proxy.\n• Coordination in infrastructure, security, containers and cloud services.\n\nThis project represented a comprehensive experience, covering from design and development to real production deployment on Azure and AWS, and consolidating skills in backend development, scalable architecture and multiplatform cloud solutions.\n\n🔗 Project URL (AWS – now inactive): https://zuvopet.duckdns.org",
      "CHARLAS_TAJAMAR": "This frontend web development project was created collaboratively by three classmates from my master's degree and me, being recognized as the best work and selected for production implementation. The application is currently deployed on Azure and accessible.\n\nWe developed the solution using VS Code and applying team work methodologies through GitHub branch management, which allowed us to effectively coordinate development. We implemented modern frontend technologies like Vue.js, HTML5 and Bootstrap, complemented with specialized libraries like ChartJS for data visualization and FullCalendar for temporal event management.\n\nThe main objective of the project was to optimize the management of talks given by students, providing an intuitive platform that significantly improves the process of programming, organization and tracking of these training activities. The successful implementation demonstrates our ability to deliver functional solutions that solve real needs in the educational environment.\n\nThis experience not only reinforced my technical knowledge, but also my collaboration skills in agile development projects oriented to tangible results.",
      "SERVICIOS_INFORMATICOS_2": "This is the second version of my project idea, developed in 2024 as Final Project for my Higher Degree in Web Application Development. The application is developed with ASP .NET Core using C#, implementing the MVC design pattern and Entity Framework. Additionally, frontend technologies such as HTML, CSS, Bootstrap, JavaScript, jQuery and AJAX have been applied to create a dynamic and responsive user experience.\n\nThe application, called \"IT Services\", provides a comprehensive platform where users can locate and contract IT services efficiently. The system is structured for two types of users: clients looking for IT solutions and professionals offering their services, each with specific functionalities adapted to their particular needs.\n\nThis project represents a significant evolution compared to my previous work, demonstrating notable progression in my development skills. The comparison between both versions shows substantial improvements in both design and architecture and functionalities.\n\nMain functionalities:\n• Authentication and secure user registration\n• Complete management of professional and personal profiles\n• Advanced search system for professionals by specialty\n• Detailed profile visualization with relevant information\n• Comprehensive management of service request cycle\n• Instant messaging between clients and professionals\n• Rating system for professionals\n• Valued works for professionals\n\nThe development of \"IT Services\" has consolidated my knowledge in enterprise web development with C# and the ASP.NET ecosystem, resulting in a robust platform that effectively facilitates interaction between clients and IT sector professionals.",
      "SERVICIOS_INFORMATICOS_1": "This is the first version of my project idea, developed in 2023 as Final Project for my Higher Degree in Multiplatform Application Development. The application is developed with Android Studio (with Java), implementing SQL queries to interact with the SQLite database, which is generated independently on each device.\n\nCommunication with Firebase is also established to perform real-time operations. The main objective of this project is to establish a mutually beneficial relationship between clients and professionals, where clients obtain satisfactory results by receiving services from professionals, and the latter can promote themselves and establish themselves for future jobs or ventures.\n\nMain functionalities:\n• Login and account creation\n• Personalized profile editing\n• Service advertisement creation and management\n• Advanced professional search\n• Notification system\n• Instant messaging between users",
      "CAUSALITY360": "Web application developed with Angular that provides automated analysis of Spanish news through artificial intelligence. Daily processes 5 selected news, generating analysis of origin, impact and well-founded predictions.\n\nDeveloped with Angular and TypeScript, uses SCSS for advanced styling and consumes a .NET backend API (ApiCausality360). Implements Server-Side Rendering with Angular Universal and Express for SEO optimization, plus CI/CD with GitHub Actions.\n\nMain features:\n• 5 daily news processed automatically\n• AI analysis generated by Groq with origin, impact and predictions\n• Historical similar events for additional context\n• Fully responsive design (Desktop, Tablet, Mobile)\n• Sliding side panel for detailed analysis\n• Interactive carousels with adaptive controls\n• Loading and error states handled elegantly\n• Explanatory workflow of news processing\n• Server-Side Rendering for better SEO\n\nMain functionalities include automatic daily analysis at 12:00 AM, interactive carousels with 4-step workflow, sliding side panel with complete analysis and fully adaptive design for all devices."
    },
    "POO": {
      "OBJECT_ORIENTED_PROGRAMMING": "Object-Oriented Programming (OOP)"
    }
  },
  "NAV": {
    "HOME": "Home",
    "SKILLS": "Skills",
    "EXPERIENCE": "Experience",
    "PROJECTS": "Projects"
  }
}